zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/aesa.h
#define AESA_KEY_OFFSET             0x20         /**< \brief (AESA_KEY offset) Key Register */
#define AESA_KEY_RESETVALUE         _U(0x00000000); /**< \brief (AESA_KEY reset_value) Key Register */

#define AESA_KEY_KEY0_Pos           0            /**< \brief (AESA_KEY) Key Word 0 */
#define AESA_KEY_KEY0_Msk           (_U(0xFFFFFFFF) << AESA_KEY_KEY0_Pos)
#define AESA_KEY_KEY0(value)        (AESA_KEY_KEY0_Msk & ((value) << AESA_KEY_KEY0_Pos))
#define AESA_KEY_MASK               _U(0xFFFFFFFF) /**< \brief (AESA_KEY) MASK Register */

/* -------- AESA_INITVECT : (AESA Offset: 0x40) ( /W 32) INITVECT Initialization Vector Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t INITVECT0:32;     /*!< bit:  0..31  Initialization Vector Word 0       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AESA_INITVECT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AESA_INITVECT_OFFSET        0x40         /**< \brief (AESA_INITVECT offset) Initialization Vector Register */
#define AESA_INITVECT_RESETVALUE    _U(0x00000000); /**< \brief (AESA_INITVECT reset_value) Initialization Vector Register */

#define AESA_INITVECT_INITVECT0_Pos 0            /**< \brief (AESA_INITVECT) Initialization Vector Word 0 */
#define AESA_INITVECT_INITVECT0_Msk (_U(0xFFFFFFFF) << AESA_INITVECT_INITVECT0_Pos)
#define AESA_INITVECT_INITVECT0(value) (AESA_INITVECT_INITVECT0_Msk & ((value) << AESA_INITVECT_INITVECT0_Pos))
#define AESA_INITVECT_MASK          _U(0xFFFFFFFF) /**< \brief (AESA_INITVECT) MASK Register */

/* -------- AESA_IDATA : (AESA Offset: 0x50) ( /W 32) Input Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t IDATA:32;         /*!< bit:  0..31  Input Data                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AESA_IDATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AESA_IDATA_OFFSET           0x50         /**< \brief (AESA_IDATA offset) Input Data Register */
#define AESA_IDATA_RESETVALUE       _U(0x00000000); /**< \brief (AESA_IDATA reset_value) Input Data Register */

#define AESA_IDATA_IDATA_Pos        0            /**< \brief (AESA_IDATA) Input Data */
#define AESA_IDATA_IDATA_Msk        (_U(0xFFFFFFFF) << AESA_IDATA_IDATA_Pos)
#define AESA_IDATA_IDATA(value)     (AESA_IDATA_IDATA_Msk & ((value) << AESA_IDATA_IDATA_Pos))
#define AESA_IDATA_MASK             _U(0xFFFFFFFF) /**< \brief (AESA_IDATA) MASK Register */

/* -------- AESA_ODATA : (AESA Offset: 0x60) (R/  32) Output Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ODATA:32;         /*!< bit:  0..31  Output Data                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AESA_ODATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AESA_ODATA_OFFSET           0x60         /**< \brief (AESA_ODATA offset) Output Data Register */
#define AESA_ODATA_RESETVALUE       _U(0x00000000); /**< \brief (AESA_ODATA reset_value) Output Data Register */

#define AESA_ODATA_ODATA_Pos        0            /**< \brief (AESA_ODATA) Output Data */
#define AESA_ODATA_ODATA_Msk        (_U(0xFFFFFFFF) << AESA_ODATA_ODATA_Pos)
#define AESA_ODATA_ODATA(value)     (AESA_ODATA_ODATA_Msk & ((value) << AESA_ODATA_ODATA_Pos))
#define AESA_ODATA_MASK             _U(0xFFFFFFFF) /**< \brief (AESA_ODATA) MASK Register */

/* -------- AESA_DRNGSEED : (AESA Offset: 0x70) ( /W 32) DRNG Seed Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEED:32;          /*!< bit:  0..31  DRNG Seed                          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AESA_DRNGSEED_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AESA_DRNGSEED_OFFSET        0x70         /**< \brief (AESA_DRNGSEED offset) DRNG Seed Register */
#define AESA_DRNGSEED_RESETVALUE    _U(0x00000000); /**< \brief (AESA_DRNGSEED reset_value) DRNG Seed Register */

#define AESA_DRNGSEED_SEED_Pos      0            /**< \brief (AESA_DRNGSEED) DRNG Seed */
#define AESA_DRNGSEED_SEED_Msk      (_U(0xFFFFFFFF) << AESA_DRNGSEED_SEED_Pos)
#define AESA_DRNGSEED_SEED(value)   (AESA_DRNGSEED_SEED_Msk & ((value) << AESA_DRNGSEED_SEED_Pos))
#define AESA_DRNGSEED_MASK          _U(0xFFFFFFFF) /**< \brief (AESA_DRNGSEED) MASK Register */

/* -------- AESA_PARAMETER : (AESA Offset: 0xF8) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t KEYSIZE:2;        /*!< bit:  0.. 1  Maximum Key Size                   */
    uint32_t OPMODE:3;         /*!< bit:  2.. 4  Maximum Number of Confidentiality Modes of Operation */
    uint32_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint32_t CTRMEAS:1;        /*!< bit:      8  Countermeasures                    */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AESA_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AESA_PARAMETER_OFFSET       0xF8         /**< \brief (AESA_PARAMETER offset) Parameter Register */
#define AESA_PARAMETER_RESETVALUE   _U(0x00000112); /**< \brief (AESA_PARAMETER reset_value) Parameter Register */

#define AESA_PARAMETER_KEYSIZE_Pos  0            /**< \brief (AESA_PARAMETER) Maximum Key Size */
#define AESA_PARAMETER_KEYSIZE_Msk  (_U(0x3) << AESA_PARAMETER_KEYSIZE_Pos)
#define AESA_PARAMETER_KEYSIZE(value) (AESA_PARAMETER_KEYSIZE_Msk & ((value) << AESA_PARAMETER_KEYSIZE_Pos))
#define AESA_PARAMETER_OPMODE_Pos   2            /**< \brief (AESA_PARAMETER) Maximum Number of Confidentiality Modes of Operation */
#define AESA_PARAMETER_OPMODE_Msk   (_U(0x7) << AESA_PARAMETER_OPMODE_Pos)
#define AESA_PARAMETER_OPMODE(value) (AESA_PARAMETER_OPMODE_Msk & ((value) << AESA_PARAMETER_OPMODE_Pos))
#define AESA_PARAMETER_CTRMEAS_Pos  8            /**< \brief (AESA_PARAMETER) Countermeasures */
#define AESA_PARAMETER_CTRMEAS      (_U(0x1) << AESA_PARAMETER_CTRMEAS_Pos)
#define AESA_PARAMETER_MASK         _U(0x0000011F) /**< \brief (AESA_PARAMETER) MASK Register */

